---
type: UIThemeManager
namespace: Autodesk.Revit.UI
version: 2024
members: 5
tags: [revit-api, class]
---

# UIThemeManager

`Autodesk.Revit.UI.UIThemeManager` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetThemeName | 2014 | `public static string GetThemeName ( UITheme frameTheme )` |
| Property | CurrentCanvasTheme | 2024 | `public static UITheme CurrentCanvasTheme { get ; set ; }` |
| Property | CurrentTheme | 2014 | `public static UITheme CurrentTheme { get ; set ; }` |
| Property | DefaultTheme | 2014 | `[ ObsoleteAttribute ("This property is deprecated in Revit 2024 and may be removed in a future version of Revit the replacement is CurrentTheme property.")] public static UITheme DefaultTheme { get ; set ; }` |
| Property | FollowSystemColorTheme | 2024 | `public static bool FollowSystemColorTheme { get ; set ; }` |